package Day08;

public class _06_과제 {

	public static void main(String[] args) {
		
		/* 야구게임
		 * 컴퓨터가 3자리의 숫자를 랜덤 생성 (1~9까지 중복 없이 생성)
		 * user가 3자리 숫자를 맞추는 게임.
		 * 자리와 숫자가 일치하면 strike
		 * 숫자만 일치하면 ball
		 * 아무것도 없으면 out
		 * ex) 컴퓨터 숫자가 3 5 7 이고
		 *     유저의 숫자가 3 6 7 이면 2s
		 *     
		 *     3 5 7
		 *     3 7 6 => 1s 1b
		 *     
		 *     3 5 7 
		 *     7 3 5 => 3b
		 *     
		 *     3 5 7
		 *     1 2 6 => out
		 *     
		 * ex) 출력 예시     
		 * --야구 게임 시작--
		 * 컴퓨터가 숫자를 정했습니다.
		 * 숫자 입력(1~9까지 3자리) :
		 * 3 4 5
		 * 결과 :
		 * 3s 다 맞으면 종료 (게임 횟수 출력)
		 */
		
		
		/* 필요해 보이는 기능
		 * 1. 랜덤 메서드
		 * 2. 컴퓨터 중복 없는 배열 생성 메서드
		 * 3. 유저 입력 메서드
		 * 4. 일치 여부 계산 후 결과 출력 메서드
		 */

	}

}
